console.log("Js work");

   function process() {
       var height = $('#height').val();
       var weight = $('#weight').val();
       
       $.ajax({
          url: 'Main/Sytem.php',
          type: 'post',
          data: {height: height, weight: weight},
          success: function(data) {
                  $('#showmybmi').html(data);
                  if (data <= 18.50 && data != 0) {
                     $('#suggestion').html("น้ำหนักน้อย (<18.5) : น้ำหนักน้อยกว่าปกติ หากใครสูงแต่น้ำหนักน้อยเกินไปอาจเสี่ยงต่อการได้รับสารอาหาร หรือพลังงานไม่เพียงพออาจส่งผลทำให้ร่างกายอ่อนเพลียง่าย สาวคนไหนที่น้ำหนักน้อยเกินไปควรกินอาหารให้เพียงพอ ควบคู่กับการออกกำลังกายเพื่อเสริมสร้างกล้ามเนื้อ ก็สามารถเพิ่มค่า BMI ให้อยู่ในเกณฑ์ปกติได้");
                     
                  } else if (data >= 18.50 && data <= 22.99) {
                     $('#suggestion').html("น้ำหนักปกติ (18.5 - 22.9) : น้ำหนักที่เหมาะสมสำหรับคนไทยคือค่า BMI ระหว่าง 18.5 - 22.9 จัดอยู่ในเกณฑ์ปกติ ห่างไกลโรคที่จะเกิดจากความอ้วน และลดความเสี่ยงต่อการเกิดโรคต่าง ๆ ได้ดี สาว ๆ ที่คำนวณแล้วได้ตัวเลขแถวนี้ ควรพยายามรักษาค่า BMI ให้อยู่ในระดับนี้นาน ๆ");
                     
                  } else if (data >= 23 && data <= 24.99) {
                     $('#suggestion').html("น้ำหนักเกิน (23 - 24.9) : พยายามลดน้ำหนักอีกนิดเพื่อให้ค่า BMI อยู่ในเกณฑ์มาตรฐาน เพราะค่า BMI ในช่วงนี้ถือว่าอยู่ในกลุ่มคนอ้วนอยู่บ้างถึงจะไม่ถือว่าอ้วนเลย แต่ถ้าคนในครอบครัวมีประวัติเคยเป็นโรคเบาหวานหรือความดันโลหิตสูง ก็ถือว่ามีความเสี่ยงมากกว่าคนปกติ");
                     
                  } else if (data >= 25 && data <= 29.99) {
                     $('#suggestion').html("โรคอ้วน (25 - 29.9) : มาถึงตรงนี้ต้องบอกว่าสาว ๆ จะอยู่ในความอ้วนระดับหนึ่ง แม้จะไม่ถึงเกณฑ์ที่อ้วนมากแต่ก็ยังเสี่ยงต่อการเกิดโรคที่มากับความอ้วน ทั้งความดันเอย เบาหวานเอย ฉะนั้นระวังและลดน้ำหนักจะดีกว่า ");
                     
                  } else if (data >= 30) {
                     $('#suggestion').html("อ้วนมาก (>30) : อันนี้ค่อนข้างอันตรายเพราะอยู่ในเกณฑ์อ้วนมากกก เสี่ยงต่อการเกิดโรคร้ายแรงที่แฝงมากับความอ้วน หากค่า BMI อยู่ในระดับนี้ จะต้องระวังการกินไขมัน และควรออกกำลังกายอย่างสม่ำเสมอ ");
                     
                  }
                  
               }
       });
   }